package com.lalilu.extension

object Constants {
    val lyric1 = """
        稻香 (Demo) - 周杰伦
        作词 : 周杰伦
        作曲：周杰伦
        对这个世界如果你有太多的抱怨
        跌倒了就不敢继续往前走
        为什么人要这么的脆弱 堕落
        请你打开电视看看
        多少人为生命在努力勇敢的走下去
        我们是不是该知足
        珍惜一切 就算没有拥有
        还记得你说家是唯一的城堡
        随着稻香河流继续奔跑
        微微笑 小时候的梦我知道
        不要哭让萤火虫带着你逃跑
        乡间的歌谣永远的依靠
        回家吧 回到最初的美好
    """.trimIndent()

    val lyric2 = """
        乘着风 游荡在蓝天边
        一片云掉落在我面前
        捏成你的形状 随风跟着我
        一口一口 吃掉忧愁
        载着你 仿佛载着阳光
        不管到哪里 都是晴天
        蝴蝶自在飞 花也布满天
        一朵一朵 因你而香
        试图让夕阳飞翔 带领你我环绕大自然
        迎着风 开始共渡每一天
        手牵手 一步两步三步四步 望着天
        看星星 一颗两颗三颗四颗 连成线
        背对背默默许下心愿 看远方的星 是否听得见
        手牵手 一步两步三步四步 望着天
        看星星 一颗两颗三颗四颗 连成线
        背对背默默许下心愿 看远方的星 如果听得见
        它一定实现
    """.trimIndent()

    val lyric3 = """
        轻轻的我走了，
        正如我轻轻的来；
        我轻轻的招手，
        作别西天的云彩。

        那河畔的金柳，
        是夕阳中的新娘；
        波光里的艳影，
        在我的心头荡漾。

        软泥上的青荇，
        油油的在水底招摇；
        在康河的柔波里，
        我甘心做一条水草！

        那榆荫下的一潭，
        不是清泉，
        是天上虹；
        揉碎在浮藻间，
        沉淀着彩虹似的梦。

        寻梦？
        撑一支长篙，
        向青草更青处漫溯；
        满载一船星辉，
        在星辉斑斓里放歌。

        但我不能放歌，
        悄悄是别离的笙箫；
        夏虫也为我沉默，
        沉默是今晚的康桥！

        悄悄的我走了，
        正如我悄悄的来；
        我挥一挥衣袖，
        不带走一片云彩。
    """.trimIndent()
}